#ifndef VOVAN_AUDIO_PREMADE_TEXT_HPP
#define VOVAN_AUDIO_PREMADE_TEXT_HPP

#include <array>

namespace bot
{
namespace premade_binary_data
{
constexpr char help_string[] = "Доступные команды:      \n"
                               "\n"
                               "          'шар (сообщение)',\n"
                               "          'зацен (сообщение)',\n"
                               "          'хейт (сообщение)',\n"
                               "          'печать деф/квад (сообщение)',\n"
                               "          'dsp [ команды ] (пересланное сообщение)' - подробнее по dsp help";
constexpr char legend_1[] =
    "Легенда про рыцаря Апостола\n"
    "Глава 1. Вступление\n"
    "Жил был на свете славный и прекрасный юноша Просто Максим А.Постол, и захотел он найти себе приключений в жизни, начал писать биты, у него это не получалось, но он писал, и старался, хотел быть как скарлорд и планомерно двигался к своей цели.\n"
    "Глава 2. Неожиданные враги\n"
    "На просторах интернета славный рыцарь А.Постол нашёл конфу СССР, где и решил остался на ночлег, но вдруг, из-за барной стойки трактира выходит высокий, злой Ебаный Богдана, и говорит апостолу:\n"
    "-Ты ебло блять настолько тупое, что тебе не место тут\n"
    "Но славный рыцарь А.Постол не расстроился, и быстро использовал заклинание на Ебаного Богдана:\n"
    "- Убеал В Гондон Ухол\n"
    "Глава 3. Прекрасный финал\n"
    "Спустя несколько мгновений, Ебаный Богдана превратился в камень и распался на маленькие кусочки адекватности, а славный рыцарь А.Постол пошёл дальше писать мелодии с автотюном";

constexpr char legend_2[] =
    "Глава 4. Новые друзья\n"
    "После смерти Ебаный Богдана прошло уже не мало времени. Апостол же, полностью потерявший тягу к жизни, сбился с праведного пути отважного рыцаря. Однако осталась в нем капля сожаления от содеянного греха, и решил он помолиться Некроманту сиКССниткову дабы воскресить Ебаный Богдана. Однако Снитков сказал,что он лишь может перенести рыцаря А.Постола в мир иной дабы вернуть его в потерянное королевство САУСАГЕ. Королевство же претерпело немало изменений:\n"
    "ГУЛАГИ,СССР,КОРЗИНЫ,СМЕРТЬ КОКОРЕВА.\n"
    "Вернувшись в королевство,А.Постол решил найти себя подхалима чтобы его 808 казался пердящим,а краши - не басистыми.\n"
    "Однажды, в окрашенной многолетними войнами кровью степи, он встретил одинокого странника именовавшего себя ФОНК. Рыцарь А. Постол спросил происхождение его имени.Однако тот ответил, что у него было тысячи имен среди которых:\n"
    "Эмилиан ФЕНазернест\n"
    "Бад Дваир\n"
    "Северная сторона Шавухи\n"
    "И тут отважному рыцарю пришла идея сделать из ФОНКА терпилу и подхалима. Спланировал все действия, А.Постол решил на рассвете присунуть в странника свой Озон.\n"
    "Однако не дождавшись рассвета,Эрнест умер от запретного напитка. Многие называют их энергетическими зельями.\n"
    "Ни капельки не расстроившись, Рыцарь А.Постол присунул уже бледному Эрнесту, и отправился в дальний путь.\n"
    "На своем пути тот встретил смелого мальчика имени которого никто не знал. Странник назвался ВладеСлавом. Странник ВладеСлав был новым жителем королевства, и видимо, его не научили в детстве выживанию в подобных местах.\n"
    "Наконец,наш рыцарь понял, что странник ВладеСлав и есть избранник на пост прислуги и подхалима.Поэтому следуя древним традициям А. Постол обосрался и обосрал ВладеСлава.\n"
    "Продолжение следует.....";

constexpr std::array<const char*, 2> rubrics = {
    "Рубрика в мире животных... Сегодня мы рассмотрим животных, использующих эФеЛ."
    "Они рано умирают, т.к здоровый, умеющий думать человек не будет использовать этот секвенсор не под дулом пистолета",
    "Рубрика 'акрессивная мотивация' Чё за говно вы делаете, нелюди, хватит блять срать в уши обывателей, вы в своей фл "
    "задроченой никогда не сможете сделать что-то новое, спуститесь с небес на землю, вас тут ждут. Вы либо делайте что-то своё, либо не ебите мне "
    "голову тем как накрутить такой пиздатый кик, я 6 лет менял полярности в сэмлах чтобы у меня бит звучал, вам же "
    "ничего не надо кроме ютуба ебучего и парочки сэмплов, спизженных у людей которые всю душу вложили в то чтобы вы "
    "потом их этого сделали свою однообразную хуйню построенную на системе кик/клэп/808 Вы блять вдумайтесь хотя бы"
    "что вы делаете, музыканты хуевы, а потом уже меня учите что модно а что нет!"};

constexpr std::array<const char*, 5> phrases_for_who = {
    "Автотюновый анализатор пидораса показывает на",
    "Духи говорят это",
    "Я думаю это",
    "Апостол подсказывает, что это",
    "Да мне похуй честно, но это"};

constexpr std::array<const char*, 27> quotes = {
    "А можно ревера на саб-бас дать?",
    "Бас или Басс?",
    "Я рофлю",
    "Ебаная Богдана",
    "Польша заебись ",
    "Скарлорд заебись ",
    "У меня какая-то хуйня после детект питч регион, пацаны",
    "Как попасть в тон? ",
    "Семён, ты заебал. *id190727695 (.) *id214894926 (.)",
    "Иди нахуй Вова ",
    "Я кинул автотюн на мелодию ",
    "Где взять семплы? ",
    "Есть ключ на Weiss?",
    "Покупаем свежий курс по клауд-репу",
    "Нихуя себе ты там в отеле, а я лежу тут, на кровати блять сосновой",
    "Е гор крид сделал мир",
    "Армения не город\n а, это Америка",
    "Краш басит",
    "Хеты не в тон",
    "Мне похуй",
    "БОГДАН ТЫ ЗАЕБАЛ обижать",
    "Чмо ебанное",
    "Пизда то написал",
    "Тебя жизнь правканула",
    "Автотюновый анализатор пидораса",
    "реп это жанр музыки",
    "Во ты молодец как всегда хуйня и пережал"};

constexpr std::array<const char*, 16> snus = {
    "мир снюс откинулся",
    "Девушка с татуировкой шайбы",
    "Пираты хаусового моря: Сундук УК баслина",
    "Парк Юрского Вторяка",
    "Вкид и молчаливый Боб",
    "Пираты Корвусовского моря: Саратовские не рассказывают маме",
    "Вкид или мама будет ругать",
    "Малыш на вкиде",
    "техасский вкид вторяком",
    "Побег из Шайбашенка",
    "вечное сияние чистого корвуса",
    "Хан Шайба и его Вторяк Тысячилетия",
    "человек - швейцарский снюс",
    "Унесённые вторяком",
    "Универсальный Вкид",
    "Инспектор Корвус"};

}
}




#endif// VOVAN_AUDIO_PREMADE_TEXT_HPP
